const SPECIALTIES = [
  // ----- СПЕЦИАЛЬНОСТИ С НАПРАВЛЕНИЯМИ -----
  {"code": "09.01.03", "name": "Оператор информационных систем и ресурсов", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "27.03.05", "name": "Инноватика"}
  ]},
  {"code": "09.01.04", "name": "Наладчик аппаратных и программных средств инфокоммуникационных систем", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "09.01.05", "name": "Оператор технической поддержки", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "09.02.01", "name": "Компьютерные системы и комплексы", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "27.03.05", "name": "Инноватика"},
    {"code": "38.03.05", "name": "Бизнес-информатика"},
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"},
    {"code": "42.03.05", "name": "Медиакоммуникации"}
  ]},
  {"code": "09.02.02", "name": "Компьютерные сети", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "09.02.03", "name": "Программирование в компьютерных системах", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "38.03.05", "name": "Бизнес-информатика"}
  ]},
  {"code": "09.02.04", "name": "Информационные системы (по отраслям)", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "37.03.01", "name": "Психология"},
    {"code": "38.03.01", "name": "Экономика"},
    {"code": "38.03.05", "name": "Бизнес-информатика"},
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"}
  ]},
  {"code": "09.02.05", "name": "Прикладная информатика (по отраслям)", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "37.03.01", "name": "Психология"},
    {"code": "38.03.01", "name": "Экономика"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"}
  ]},
  {"code": "09.02.06", "name": "Сетевое и системное администрирование", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "27.03.05", "name": "Инноватика"}
  ]},
  {"code": "09.02.07", "name": "Информационные системы и программирование", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "37.03.01", "name": "Психология"},
    {"code": "38.03.05", "name": "Бизнес-информатика"},
    {"code": "42.03.05", "name": "Медиакоммуникации"}
  ]},
  {"code": "09.02.08", "name": "Интеллектуальные интегрированные системы", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "09.02.09", "name": "Веб-разработка", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "09.02.10", "name": "Разработка компьютерных игр, дополненной и виртуальной реальности", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "09.02.11", "name": "Разработка и управление программным обеспечением", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "27.03.05", "name": "Инноватика"}
  ]},
  {"code": "09.02.12", "name": "Техническая эксплуатация и сопровождение информационных систем", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "09.02.13", "name": "Интеграция решений с применением технологий искусственного интеллекта", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "27.03.05", "name": "Инноватика"}
  ]},
  {"code": "10.02.01", "name": "Организация и технология защиты информации", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "38.03.05", "name": "Бизнес-информатика"}
  ]},
  {"code": "10.02.02", "name": "Информационная безопасность телекоммуникационных систем", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "38.03.05", "name": "Бизнес-информатика"}
  ]},
  {"code": "10.02.03", "name": "Информационная безопасность автоматизированных систем", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "38.03.05", "name": "Бизнес-информатика"}
  ]},
  {"code": "10.02.04", "name": "Обеспечение информационной безопасности телекоммуникационных систем", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "10.02.05", "name": "Обеспечение информационной безопасности автоматизированных систем", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "11.01.01", "name": "Монтажник радиоэлектронной аппаратуры и приборов", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "11.01.02", "name": "Радиомеханик", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "11.01.05", "name": "Монтажник связи", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "11.01.08", "name": "Оператор почтовой связи", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "11.02.05", "name": "Аудиовизуальная техника", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "42.03.02", "name": "Журналистика"}
  ]},
  {"code": "11.02.07", "name": "Радиотехнические информационные системы", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "42.03.02", "name": "Журналистика"}
  ]},
  {"code": "11.02.08", "name": "Средства связи с подвижными объектами", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "11.02.09", "name": "Многоканальные телекоммуникационные системы", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "42.03.02", "name": "Журналистика"}
  ]},
  {"code": "11.02.10", "name": "Радиосвязь, радиовещание и телевидение", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "42.03.02", "name": "Журналистика"}
  ]},
  {"code": "11.02.11", "name": "Сети связи и системы коммутации", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "42.03.02", "name": "Журналистика"}
  ]},
  {"code": "11.02.12", "name": "Почтовая связь", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"}
  ]},
  {"code": "11.02.14", "name": "Электронные приборы и устройства", "directions": [
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "11.02.15", "name": "Инфокоммуникационные сети и системы связи", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "11.02.17", "name": "Разработка электронных устройств и систем", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "11.02.18", "name": "Системы радиосвязи, мобильной связи и телерадиовещания", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "12.02.01", "name": "Авиационные приборы и комплексы", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "13.01.10", "name": "Электромонтер по ремонту и обслуживанию электрооборудования (по отраслям)", "directions": [
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "13.02.03", "name": "Электрические станции, сети и системы", "directions": [
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "13.02.06", "name": "Релейная защита и автоматизация электроэнергетических систем", "directions": [
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "13.02.07", "name": "Электроснабжение (по отраслям)", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "13.02.09", "name": "Монтаж и эксплуатация линий электропередачи", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "13.02.11", "name": "Техническая эксплуатация и обслуживание электрического и электромеханического оборудования (по отраслям)", "directions": [
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "15.01.31", "name": "Мастер контрольно-измерительных приборов и автоматики", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "15.02.01", "name": "Монтаж и техническая эксплуатация промышленного оборудования (по отраслям)", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"}
  ]},
  {"code": "15.02.02", "name": "Техническая эксплуатация оборудования для производства электронной техники", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"}
  ]},
  {"code": "15.02.03", "name": "Техническая эксплуатация гидравлических машин, гидроприводов и гидропневмоавтоматики", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"}
  ]},
  {"code": "15.02.04", "name": "Специальные машины и устройства", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "15.02.08", "name": "Технология машиностроения", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"}
  ]},
  {"code": "15.02.09", "name": "Аддитивные технологии", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "21.03.02", "name": "Землеустройство и кадастры"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.05", "name": "Бизнес-информатика"}
  ]},
  {"code": "15.02.16", "name": "Технология машиностроения", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"}
  ]},
  {"code": "19.02.10", "name": "Технология продукции общественного питания", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"}
  ]},
  {"code": "19.02.13", "name": "Технология продуктов общественного питания массового изготовления и специализированных пищевых продуктов", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"}
  ]},
  {"code": "20.02.01", "name": "Рациональное использование природохозяйственных комплексов", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "20.02.02", "name": "Защита в чрезвычайных ситуациях", "directions": [
    {"code": "37.03.01", "name": "Психология"}
  ]},
  {"code": "20.02.03", "name": "Природоохранное обустройство территорий", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "20.02.05", "name": "Организация оперативного (экстренного) реагирования в чрезвычайных ситуациях", "directions": [
    {"code": "37.03.01", "name": "Психология"}
  ]},
  {"code": "21.01.01", "name": "Оператор нефтяных и газовых скважин", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.01.02", "name": "Оператор по ремонту скважин", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.01.03", "name": "Бурильщик эксплуатационных и разведочных скважин", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.01.04", "name": "Машинист на буровых установках", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.01", "name": "Разработка и эксплуатация нефтяных и газовых месторождений", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.02", "name": "Бурение нефтяных и газовых скважин", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.03", "name": "Сооружение и эксплуатация газонефтепроводов и газонефтехранилищ", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.04", "name": "Землеустройство", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"},
    {"code": "40.03.01", "name": "Юриспруденция"}
  ]},
  {"code": "21.02.05", "name": "Земельно-имущественные отношения", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"},
    {"code": "38.03.01", "name": "Экономика"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"}
  ]},
  {"code": "21.02.06", "name": "Информационные системы обеспечения градостроительной деятельности", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "21.03.02", "name": "Землеустройство и кадастры"},
    {"code": "38.03.01", "name": "Экономика"}
  ]},
  {"code": "21.02.07", "name": "Аэрофотогеодезия", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.08", "name": "Прикладная геодезия", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.09", "name": "Гидрогеология и инженерная геология", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.10", "name": "Геология и разведка нефтяных и газовых месторождений", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.11", "name": "Геофизические методы поисков и разведки месторождений полезных ископаемых", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.12", "name": "Технология и техника разведки месторождений полезных ископаемых", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.13", "name": "Геологическая съемка, поиски и разведка месторождений полезных ископаемых", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.14", "name": "Маркшейдерское дело", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.15", "name": "Открытые горные работы", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.16", "name": "Шахтное строительство", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.17", "name": "Подземная разработка месторождений полезных ископаемых", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.18", "name": "Обогащение полезных ископаемых", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "21.02.19", "name": "Землеустройство", "directions": [
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"}
  ]},
  {"code": "210801.01", "name": "Оператор связи", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "23.02.01", "name": "Организация перевозок и управление на транспорте (по видам)", "directions": [
    {"code": "38.03.01", "name": "Экономика"},
    {"code": "38.03.02", "name": "Менеджмент"}
  ]},
  {"code": "23.02.06", "name": "Техническая эксплуатация подвижного состава железных дорог", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"}
  ]},
  {"code": "230103.02", "name": "Мастер по обработке цифровой информации", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "230103.03", "name": "Наладчик компьютерных сетей", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "230103.04", "name": "Наладчик аппаратного и программного обеспечения", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "261701.02", "name": "Оператор электронного набора и верстки", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "42.03.02", "name": "Журналистика"}
  ]},
  {"code": "261701.05", "name": "Мастер печатного дела", "directions": [
    {"code": "42.03.02", "name": "Журналистика"}
  ]},
  {"code": "27.01.01", "name": "Контролер измерительных приборов", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"}
  ]},
  {"code": "27.02.01", "name": "Метрология", "directions": [
    {"code": "27.03.05", "name": "Инноватика"}
  ]},
  {"code": "27.02.02", "name": "Техническое регулирование и управление качеством", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"},
    {"code": "27.03.05", "name": "Инноватика"}
  ]},
  {"code": "27.02.04", "name": "Автоматические системы управления", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "21.03.02", "name": "Землеустройство и кадастры"},
    {"code": "27.03.05", "name": "Инноватика"}
  ]},
  {"code": "27.02.05", "name": "Системы и средства диспетчерского управления", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "09.03.02", "name": "Информационные системы и технологии"},
    {"code": "09.03.03", "name": "Прикладная информатика"},
    {"code": "21.03.02", "name": "Землеустройство и кадастры"}
  ]},
  {"code": "27.02.07", "name": "Управление качеством продукции, процессов и услуг (по отраслям)", "directions": [
    {"code": "27.03.05", "name": "Инноватика"}
  ]},
  {"code": "29.01.04", "name": "Художник по костюму", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "29.01.05", "name": "Закройщик", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "29.01.09", "name": "Мастер-исполнитель художественной вышивки (по видам)", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "29.01.10", "name": "Модистка головных уборов", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "29.01.31", "name": "Мастер скорняжных работ", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "29.01.32", "name": "Мастер обувного производства", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "29.01.33", "name": "Мастер по изготовлению швейных изделий", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "29.01.36", "name": "Мастер полиграфического производства", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "29.02.01", "name": "Конструирование, моделирование и технология изделий из кожи", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"}
  ]},
  {"code": "29.02.02", "name": "Технология кожи и меха", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "29.02.05", "name": "Технология текстильных изделий (по видам)", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "29.02.06", "name": "Полиграфическое производство", "directions": [
    {"code": "09.03.01", "name": "Информатика и вычислительная техника"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"},
    {"code": "42.03.02", "name": "Журналистика"}
  ]},
  {"code": "29.02.07", "name": "Производство изделий из бумаги и картона", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "42.03.02", "name": "Журналистика"}
  ]},
  {"code": "29.02.08", "name": "Технология обработки алмазов", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "29.02.10", "name": "Конструирование, моделирование и технология изготовления изделий легкой промышленности (по видам)", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "31.01.01", "name": "Медицинский администратор", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "39.03.02", "name": "Социальная работа"}
  ]},
  {"code": "31.02.01", "name": "Лечебное дело", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "39.03.02", "name": "Социальная работа"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"}
  ]},
  {"code": "31.02.02", "name": "Акушерское дело", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "39.03.02", "name": "Социальная работа"}
  ]},
  {"code": "34.01.01", "name": "Младшая медицинская сестра по уходу за больными", "directions": [
    {"code": "39.03.02", "name": "Социальная работа"}
  ]},
  {"code": "34.02.01", "name": "Сестринское дело", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "39.03.02", "name": "Социальная работа"}
  ]},
  {"code": "35.02.01", "name": "Лесное и лесопарковое хозяйство", "directions": [
    {"code": "40.03.01", "name": "Юриспруденция"}
  ]},
  {"code": "35.02.15", "name": "Кинология", "directions": [
    {"code": "40.03.01", "name": "Юриспруденция"}
  ]},
  {"code": "38.01.02", "name": "Продавец", "directions": [
    {"code": "38.03.01", "name": "Экономика"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"}
  ]},
  {"code": "38.02.01", "name": "Экономика и бухгалтерский учет (по отраслям)", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"},
    {"code": "38.03.01", "name": "Экономика"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "38.03.05", "name": "Бизнес-информатика"},
    {"code": "38.05.02", "name": "Таможенное дело"}
  ]},
  {"code": "38.02.02", "name": "Страховое дело (по отраслям)", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"},
    {"code": "38.03.01", "name": "Экономика"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "38.03.05", "name": "Бизнес-информатика"},
    {"code": "38.05.02", "name": "Таможенное дело"},
    {"code": "40.03.01", "name": "Юриспруденция"},
    {"code": "43.03.02", "name": "Туризм"}
  ]},
  {"code": "38.02.03", "name": "Операционная деятельность в логистике", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"},
    {"code": "38.03.01", "name": "Экономика"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "38.03.05", "name": "Бизнес-информатика"}
  ]},
  {"code": "38.02.04", "name": "Коммерция (по отраслям)", "directions": [
    {"code": "38.03.01", "name": "Экономика"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "38.03.05", "name": "Бизнес-информатика"}
  ]},
  {"code": "38.02.05", "name": "Товароведение и экспертиза качества потребительских товаров", "directions": [
    {"code": "38.03.01", "name": "Экономика"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"}
  ]},
  {"code": "38.02.06", "name": "Финансы", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"},
    {"code": "38.03.01", "name": "Экономика"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "38.03.05", "name": "Бизнес-информатика"}
  ]},
  {"code": "38.02.07", "name": "Банковское дело", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"},
    {"code": "38.03.01", "name": "Экономика"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "38.03.05", "name": "Бизнес-информатика"}
  ]},
  {"code": "38.02.08", "name": "Торговое дело", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"}
  ]},
  {"code": "38.02.09", "name": "Конгрессно-выставочная деятельность", "directions": [
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"}
  ]},
  {"code": "39.02.01", "name": "Социальная работа", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "39.03.02", "name": "Социальная работа"}
  ]},
  {"code": "39.02.02", "name": "Организация сурдокоммуникации", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "39.03.02", "name": "Социальная работа"},
    {"code": "45.03.01", "name": "Филология"},
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "39.02.03", "name": "Обеспечение деятельности службы занятости населения", "directions": [
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "39.03.02", "name": "Социальная работа"}
  ]},
  {"code": "40.02.01", "name": "Право и организация социального обеспечения", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "38.05.02", "name": "Таможенное дело"},
    {"code": "39.03.02", "name": "Социальная работа"},
    {"code": "40.03.01", "name": "Юриспруденция"}
  ]},
  {"code": "40.02.02", "name": "Правоохранительная деятельность", "directions": [
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "38.05.02", "name": "Таможенное дело"},
    {"code": "40.03.01", "name": "Юриспруденция"}
  ]},
  {"code": "40.02.03", "name": "Право и судебное администрирование", "directions": [
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "38.05.02", "name": "Таможенное дело"},
    {"code": "40.03.01", "name": "Юриспруденция"}
  ]},
  {"code": "40.02.04", "name": "Юриспруденция", "directions": [
    {"code": "21.03.02", "name": "Землеустройство и кадастры"},
    {"code": "37.03.01", "name": "Психология"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "38.03.05", "name": "Бизнес-информатика"},
    {"code": "38.05.02", "name": "Таможенное дело"},
    {"code": "40.03.01", "name": "Юриспруденция"}
  ]},
  {"code": "42.02.01", "name": "Реклама", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"},
    {"code": "42.03.02", "name": "Журналистика"},
    {"code": "42.03.05", "name": "Медиакоммуникации"},
    {"code": "43.03.02", "name": "Туризм"},
    {"code": "45.03.01", "name": "Филология"}
  ]},
  {"code": "42.02.02", "name": "Издательское дело", "directions": [
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"},
    {"code": "42.03.02", "name": "Журналистика"},
    {"code": "42.03.05", "name": "Медиакоммуникации"},
    {"code": "45.03.01", "name": "Филология"}
  ]},
  {"code": "43.02.01", "name": "Организация обслуживания в общественном питании", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "39.03.02", "name": "Социальная работа"}
  ]},
  {"code": "43.02.03", "name": "Стилистика и искусство визажа", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"}
  ]},
  {"code": "43.02.05", "name": "Флористика", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"}
  ]},
  {"code": "43.02.06", "name": "Сервис на транспорте (по видам транспорта)", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "38.03.03", "name": "Управление персоналом"}
  ]},
  {"code": "43.02.08", "name": "Сервис домашнего и коммунального хозяйства", "directions": [
    {"code": "38.03.03", "name": "Управление персоналом"}
  ]},
  {"code": "43.02.10", "name": "Туризм", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "43.03.02", "name": "Туризм"},
    {"code": "45.03.02", "name": "Лингвистика"},
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"}
  ]},
  {"code": "43.02.11", "name": "Гостиничный сервис", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "43.03.02", "name": "Туризм"},
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"}
  ]},
  {"code": "43.02.14", "name": "Гостиничное дело", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "43.03.02", "name": "Туризм"}
  ]},
  {"code": "43.02.16", "name": "Туризм и гостеприимство", "directions": [
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "43.03.02", "name": "Туризм"}
  ]},
  {"code": "44.02.01", "name": "Дошкольное образование", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "39.03.02", "name": "Социальная работа"},
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "45.03.01", "name": "Филология"},
    {"code": "45.03.02", "name": "Лингвистика"},
    {"code": "46.03.01", "name": "История"}
  ]},
  {"code": "44.02.02", "name": "Преподавание в начальных классах", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "39.03.02", "name": "Социальная работа"},
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "45.03.01", "name": "Филология"},
    {"code": "45.03.02", "name": "Лингвистика"},
    {"code": "46.03.01", "name": "История"}
  ]},
  {"code": "44.02.03", "name": "Педагогика дополнительного образования", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "39.03.02", "name": "Социальная работа"},
    {"code": "40.03.01", "name": "Юриспруденция"},
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "45.03.01", "name": "Филология"},
    {"code": "45.03.02", "name": "Лингвистика"},
    {"code": "46.03.01", "name": "История"},
    {"code": "42.03.02", "name": "Журналистика"}
  ]},
  {"code": "44.02.04", "name": "Специальное дошкольное образование", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "39.03.02", "name": "Социальная работа"},
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "45.03.01", "name": "Филология"},
    {"code": "45.03.02", "name": "Лингвистика"},
    {"code": "46.03.01", "name": "История"}
  ]},
  {"code": "44.02.05", "name": "Коррекционная педагогика в начальном образовании", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "39.03.02", "name": "Социальная работа"},
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "45.03.01", "name": "Филология"},
    {"code": "45.03.02", "name": "Лингвистика"},
    {"code": "46.03.01", "name": "История"}
  ]},
  {"code": "44.02.06", "name": "Профессиональное обучение (по отраслям)", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "39.03.02", "name": "Социальная работа"},
    {"code": "40.03.01", "name": "Юриспруденция"},
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "45.03.01", "name": "Филология"},
    {"code": "45.03.02", "name": "Лингвистика"},
    {"code": "46.03.01", "name": "История"},
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"},
    {"code": "42.03.02", "name": "Журналистика"}
  ]},
  {"code": "44.02.07", "name": "Преподавание в основном общем образовании (по профилям)", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"}
  ]},
  {"code": "46.01.03", "name": "Делопроизводитель", "directions": [
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "40.03.01", "name": "Юриспруденция"},
    {"code": "46.03.01", "name": "История"}
  ]},
  {"code": "46.02.01", "name": "Документационное обеспечение управления и архивоведение", "directions": [
    {"code": "38.03.03", "name": "Управление персоналом"},
    {"code": "38.03.04", "name": "Государственное и муниципальное управление"},
    {"code": "40.03.01", "name": "Юриспруденция"},
    {"code": "46.03.01", "name": "История"}
  ]},
  {"code": "49.02.01", "name": "Физическая культура", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"}
  ]},
  {"code": "49.02.02", "name": "Адаптивная физическая культура", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"}
  ]},
  {"code": "49.02.03", "name": "Спорт", "directions": [
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"}
  ]},
  {"code": "50.02.01", "name": "Мировая художественная культура", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "51.02.01", "name": "Народное художественное творчество (по видам)", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "51.02.02", "name": "Социально-культурная деятельность (по видам)", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"},
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "52.05.01", "name": "Актерское искусство"},
    {"code": "55.05.01", "name": "Режиссура кино и телевидения"},
    {"code": "42.03.05", "name": "Медиакоммуникации"}
  ]},
  {"code": "51.02.03", "name": "Библиотековедение (Библиотечно-информационная деятельность)", "directions": [
    {"code": "38.03.02", "name": "Менеджмент"}
  ]},
  {"code": "52.02.01", "name": "Искусство балета*", "directions": [
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "52.02.01", "name": "Искусство балета", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "52.05.01", "name": "Актерское искусство"},
    {"code": "55.05.01", "name": "Режиссура кино и телевидения"}
  ]},
  {"code": "52.02.02", "name": "Искусство танца (по видам)*", "directions": [
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "52.02.02", "name": "Искусство танца (по видам)", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "52.05.01", "name": "Актерское искусство"},
    {"code": "55.05.01", "name": "Режиссура кино и телевидения"}
  ]},
  {"code": "52.02.03", "name": "Цирковое искусство*", "directions": [
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "52.02.03", "name": "Цирковое искусство", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "52.05.01", "name": "Актерское искусство"},
    {"code": "55.05.01", "name": "Режиссура кино и телевидения"}
  ]},
  {"code": "52.02.04", "name": "Актерское искусство*", "directions": [
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "52.02.04", "name": "Актерское искусство", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "52.05.01", "name": "Актерское искусство"},
    {"code": "55.05.01", "name": "Режиссура кино и телевидения"}
  ]},
  {"code": "52.02.05", "name": "Искусство эстрады*", "directions": [
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "52.02.05", "name": "Искусство эстрады", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "52.05.01", "name": "Актерское искусство"}
  ]},
  {"code": "53.02.01", "name": "Музыкальное образование*", "directions": [
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"}
  ]},
  {"code": "53.02.01", "name": "Музыкальное образование", "directions": [
    {"code": "46.03.01", "name": "История"},
    {"code": "55.05.01", "name": "Режиссура кино и телевидения"}
  ]},
  {"code": "53.02.02", "name": "Музыкальное искусство эстрады (по видам)*", "directions": [
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"}
  ]},
  {"code": "53.02.02", "name": "Музыкальное искусство эстрады (по видам)**", "directions": [
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "53.02.02", "name": "Музыкальное искусство эстрады (по видам)", "directions": [
    {"code": "52.05.01", "name": "Актерское искусство"}
  ]},
  {"code": "53.02.03", "name": "Инструментальное исполнительство (по видам инструментов)", "directions": [
    {"code": "45.03.02", "name": "Лингвистика"},
    {"code": "52.05.01", "name": "Актерское искусство"}
  ]},
  {"code": "53.02.04", "name": "Вокальное искусство**", "directions": [
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "53.02.04", "name": "Вокальное искусство", "directions": [
    {"code": "52.05.01", "name": "Актерское искусство"},
    {"code": "55.05.01", "name": "Режиссура кино и телевидения"}
  ]},
  {"code": "53.02.05", "name": "Сольное и хоровое народное пение**", "directions": [
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "53.02.05", "name": "Сольное и хоровое народное пение", "directions": [
    {"code": "52.05.01", "name": "Актерское искусство"}
  ]},
  {"code": "53.02.07", "name": "Теория музыки*", "directions": [
    {"code": "44.03.01", "name": "Педагогическое образование"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"}
  ]},
  {"code": "53.02.07", "name": "Теория музыки", "directions": [
    {"code": "46.03.01", "name": "История"},
    {"code": "55.05.01", "name": "Режиссура кино и телевидения"}
  ]},
  {"code": "53.02.09", "name": "Театрально-декорационное искусство (по видам)", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "54.01.02", "name": "Ювелир", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"}
  ]},
  {"code": "54.01.06", "name": "Изготовитель художественных изделий из металла", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"}
  ]},
  {"code": "54.01.20", "name": "Графический дизайнер", "directions": [
    {"code": "54.03.01", "name": "Дизайн"},
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"}
  ]},
  {"code": "54.01.21", "name": "Изготовитель художественных изделий из твердых материалов (по видам, за исключением металла)", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"}
  ]},
  {"code": "54.01.22", "name": "Реставратор", "directions": [
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"}
  ]},
  {"code": "54.02.01", "name": "Дизайн (по отраслям)", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "38.03.05", "name": "Бизнес-информатика"},
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"},
    {"code": "42.03.02", "name": "Журналистика"},
    {"code": "42.03.05", "name": "Медиакоммуникации"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "54.02.01", "name": "Дизайн (по отраслям)**", "directions": [
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "54.02.02", "name": "Декоративно-прикладное искусство и народные промыслы (по видам)**", "directions": [
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "54.02.02", "name": "Декоративно-прикладное искусство и народные промыслы (по видам)", "directions": [
    {"code": "46.03.01", "name": "История"},
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "54.02.03", "name": "Художественное оформление изделий текстильной и легкой промышленности", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "54.02.04", "name": "Реставрация", "directions": [
    {"code": "46.03.01", "name": "История"}
  ]},
  {"code": "54.02.05", "name": "Живопись (по видам)", "directions": [
    {"code": "37.03.01", "name": "Психология"},
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "46.03.01", "name": "История"},
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "54.03.01", "name": "Дизайн"},
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"}
  ]},
  {"code": "54.02.05", "name": "Живопись с присвоением квалификаций художник-живописец, преподаватель**", "directions": [
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "54.02.05", "name": "Живопись (по видам)**", "directions": [
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "54.02.05", "name": "Живопись с присвоением квалификаций художник-живописец, преподаватель", "directions": [
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "54.02.06", "name": "Изобразительное искусство и черчение", "directions": [
    {"code": "44.03.02", "name": "Психолого-педагогическое образование"},
    {"code": "46.03.01", "name": "История"},
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"},
    {"code": "54.03.01", "name": "Дизайн"}
  ]},
  {"code": "54.02.06", "name": "Изобразительное искусство и черчение**", "directions": [
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "54.02.07", "name": "Скульптура** * – при наличии квалификации «преподаватель» на профиль «Теория и методика преподавания иностранных языков и культур» ** – при наличии квалификации «преподаватель»", "directions": [
    {"code": "45.03.02", "name": "Лингвистика"}
  ]},
  {"code": "54.02.07", "name": "Скульптура", "directions": [
    {"code": "46.03.01", "name": "История"},
    {"code": "50.03.01", "name": "Искусства и гуманитарные науки"}
  ]},
  {"code": "54.02.08", "name": "Техника и искусство фотографии", "directions": [
    {"code": "42.03.01", "name": "Реклама и связи с общественностью"},
    {"code": "42.03.02", "name": "Журналистика"},
    {"code": "42.03.05", "name": "Медиакоммуникации"},
    {"code": "54.03.01", "name": "Дизайн"},
    {"code": "55.05.01", "name": "Режиссура кино и телевидения"}
  ]},
  {"code": "55.02.01", "name": "Театральная и аудиовизуальная техника (по видам)", "directions": [
    {"code": "55.05.01", "name": "Режиссура кино и телевидения"},
    {"code": "42.03.05", "name": "Медиакоммуникации"}
  ]},
  {"code": "55.02.02", "name": "Анимация и анимационное кино (по видам)", "directions": [
    {"code": "55.05.01", "name": "Режиссура кино и телевидения"},
    {"code": "42.03.05", "name": "Медиакоммуникации"}
  ]},
  {"code": "55.02.03", "name": "Кино- и телепроизводство (по видам)", "directions": [
    {"code": "54.03.01", "name": "Дизайн"},
    {"code": "55.05.01", "name": "Режиссура кино и телевидения"}
  ]}
];
